Tekla Open API Reference for Tekla Structures 2025
StructuresDialogArrayAttribute.ToString Method
 Returns a string that represents the current StructuresDialogArrayAttribute object.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A string that represents the current StructuresDialogArrayAttribute object.
See Also
Reference
StructuresDialogArrayAttribute Class
Tekla.Structures.Dialog Namespace